"""
    对于零基础同学：
        当天知识点必须理解，无需死记硬背，做好笔记,不懂的立即提问。
        理解需求，知道结果。反复完成当天练习，直到独立完成。
    day05 复习
    列表
       1. 内存图  list01 = [1,2]
       2. 基础操作：
            创建空列表： list01 = []    list01 = list()
            创建具有默认值的列表：list01 = [变量,变量...]
                               list01 = list(可迭代对象)
            添加：list01.insert(索引，变量)
                 list01.append(变量)
            删除：list01.remove(变量)
                 del list01[索引]
            定位元素：索引   切片
"""
# 将右边中间的对象存入列表中
a,*b,c=1,2,3,4,5,5,6,7,8
print(a,b,c)# 1 [2, 3, 4, 5, 5, 6, 7] 8














