#!/usr/bin/env python3

import sys

goods_sql_head = "INSERT INTO `goods`(`id`, `title`, `desc`, `goods_images`, `detail_images`, `spec_name`, `is_seller_empower`, `is_admin_empower`, `is_delete`, `goods_type_id`, `seller_id`) VALUES "
goods_images = """'["0.jpg", "1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg"]'"""
details_images = """'["0.jpg", "1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg", "6.jpg", "7.jpg", "8.jpg", "9.jpg", "10.jpg", "11.jpg", "12.jpg", "13.jpg", "14.jpg", "15.jpg", "16.jpg"]'"""

goods_sql_values = [
    "(1, '梵地亚（Vantiiear）万向轮拉杆箱耐磨抗摔24英寸旅行箱男女行李箱登机箱 银色', '梵地亚（Vantiiear）万向轮拉杆箱耐磨抗摔24英寸旅行箱男女行李箱登机箱 银色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(2, '小米（MI）90分旅行箱拉杆箱1A 男女万向轮登机行李箱 20英寸 星空灰', '小米（MI）90分旅行箱拉杆箱1A 男女万向轮登机行李箱 20英寸 星空灰', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(3, '地平线8号（LEVEL8）行李箱旅行箱登机箱20英寸德国拜耳PC箱体拉杆箱 黑色（锤科出品）', '地平线8号（LEVEL8）行李箱旅行箱登机箱20英寸德国拜耳PC箱体拉杆箱 黑色（锤科出品）', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(4, '梵地亚（Vantiiear）拉杆箱万向轮耐磨抗摔行李箱20英寸旅行箱男女登机箱 黑色升级版', '梵地亚（Vantiiear）拉杆箱万向轮耐磨抗摔行李箱20英寸旅行箱男女登机箱 黑色升级版', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(5, '博兿（BOYI）行李箱24英寸万向轮拉杆箱 男女防刮耐磨密码静音旅行箱子 BY-72002银白色', '博兿（BOYI）行李箱24英寸万向轮拉杆箱 男女防刮耐磨密码静音旅行箱子 BY-72002银白色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(6, '（锤科出品）地平线8号（LEVEL8）行李箱旅行箱托运箱24英寸德国拜耳PC箱体拉杆箱黑色', '（锤科出品）地平线8号（LEVEL8）行李箱旅行箱托运箱24英寸德国拜耳PC箱体拉杆箱黑色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(7, '小米（MI）米家90分轻商务旅行箱拉杆箱 男女万向轮登机行李箱 钛金灰 20英寸 前开盖 双密码锁', '小米（MI）米家90分轻商务旅行箱拉杆箱 男女万向轮登机行李箱 钛金灰 20英寸 前开盖 双密码锁', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(8, '[防盗合金铝框]意酷拉杆箱万向轮行李箱男女小登机箱大号旅行箱20寸24寸26寸28寸密码箱学生皮箱子 海关锁款-银色（热卖款 男女士都适合） 20英寸-登机箱-商务手提上飞机手拉箱 领劵立减', '[防盗合金铝框]意酷拉杆箱万向轮行李箱男女小登机箱大号旅行箱20寸24寸26寸28寸密码箱学生皮箱子 海关锁款-银色（热卖款 男女士都适合） 20英寸-登机箱-商务手提上飞机手拉箱 领劵立减', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(9, '斯高高尔夫（SCOGOLF）拉杆箱20英寸行李箱女 旅行箱登机箱万向轮6689玫瑰金', '斯高高尔夫（SCOGOLF）拉杆箱20英寸行李箱女 旅行箱登机箱万向轮6689玫瑰金', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(10, '拉杆箱铝框行李箱男女旅行箱新品20寸登机箱万向轮密码箱 古典灰 24寸/需托运', '拉杆箱铝框行李箱男女旅行箱新品20寸登机箱万向轮密码箱 古典灰 24寸/需托运', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(11, '瑞动（SWISSMOBILITY）拉杆箱24英寸旅行箱 大容量行李箱轻盈静音万向轮男女 5555黑色', '瑞动（SWISSMOBILITY）拉杆箱24英寸旅行箱 大容量行李箱轻盈静音万向轮男女 5555黑色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(12, '【防刮型】吉鲁宾528拉杆箱 旅行箱行李箱男士女士登机箱20/24/26/29英寸箱包万向轮 玫瑰金 20英寸 登机箱', '【防刮型】吉鲁宾528拉杆箱 旅行箱行李箱男士女士登机箱20/24/26/29英寸箱包万向轮 玫瑰金 20英寸 登机箱', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(13, '爱华仕（OIWAS）飞机轮密码锁拉杆箱6182 商务出差旅行箱 行李箱男女登机箱20英寸灰色', '爱华仕（OIWAS）飞机轮密码锁拉杆箱6182 商务出差旅行箱 行李箱男女登机箱20英寸灰色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(14, 'ALLANT拉杆箱万向轮 24英寸行李箱男旅行箱 ABS时尚轻盈 AL-8503 黑色', 'ALLANT拉杆箱万向轮 24英寸行李箱男旅行箱 ABS时尚轻盈 AL-8503 黑色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(15, '小米（MI）90分旅行箱拉杆箱1A 男女万向轮行李箱 26英寸 星空灰', '小米（MI）90分旅行箱拉杆箱1A 男女万向轮行李箱 26英寸 星空灰', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(16, '瑞士军刀威戈（Wenger）拉杆箱 男女商务休闲ABS22英寸万向轮行李箱旅行箱 黑色 SAX631115109058', '瑞士军刀威戈（Wenger）拉杆箱 男女商务休闲ABS22英寸万向轮行李箱旅行箱 黑色 SAX631115109058', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(17, '90分拉杆箱24英寸 德国拜尔PC材质静音万向轮行李箱 商旅两用旅行箱 钛金灰', '90分拉杆箱24英寸 德国拜尔PC材质静音万向轮行李箱 商旅两用旅行箱 钛金灰', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(18, '迪士尼（Disney）儿童拉杆箱18英寸小学生行李箱 公主登机箱万向轮旅行箱 TFD0003-B18冰雪蓝色', '迪士尼（Disney）儿童拉杆箱18英寸小学生行李箱 公主登机箱万向轮旅行箱 TFD0003-B18冰雪蓝色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(19, '卡帝乐鳄鱼(CARTELO) 耐磨防刮24英寸拉杆箱万向轮旅行李箱男女学生密码箱时尚轻盈商务休闲行李箱包 炫酷黑', '卡帝乐鳄鱼(CARTELO) 耐磨防刮24英寸拉杆箱万向轮旅行李箱男女学生密码箱时尚轻盈商务休闲行李箱包 炫酷黑', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(20, '瑞动（SWISSMOBILITY）拉杆箱30英寸差旅大容量行李箱 防泼水静音万向轮旅行箱男女 5560黑色', '瑞动（SWISSMOBILITY）拉杆箱30英寸差旅大容量行李箱 防泼水静音万向轮旅行箱男女 5560黑色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(21, '【防刮伤】【高品质】 铝框拉杆箱万向轮行李箱男士女士旅行箱20/24/26/29英寸登机箱 高端 铝框+银色 20英寸 登机箱', '【防刮伤】【高品质】 铝框拉杆箱万向轮行李箱男士女士旅行箱20/24/26/29英寸登机箱 高端 铝框+银色 20英寸 登机箱', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(22, '蒙特布朗 铝框拉杆箱防刮旅行箱20/24/28英寸行李箱 黑色 20英寸可登机', '蒙特布朗 铝框拉杆箱防刮旅行箱20/24/28英寸行李箱 黑色 20英寸可登机', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(23, '旅行大师 新品18英寸拉杆箱女万向轮登机箱轻便小型行李箱男纯PC迷你旅行箱包韩版飞机密码箱子 经典黑 18英寸', '旅行大师 新品18英寸拉杆箱女万向轮登机箱轻便小型行李箱男纯PC迷你旅行箱包韩版飞机密码箱子 经典黑 18英寸', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(24, '七匹狼行李箱男拉杆箱旅行箱万向轮女24寸密码箱20寸登机箱箱子潮 蓝色 20英寸【官方直营·收藏加购优先发货】', '七匹狼行李箱男拉杆箱旅行箱万向轮女24寸密码箱20寸登机箱箱子潮 蓝色 20英寸【官方直营·收藏加购优先发货】', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(25, '维多利亚旅行者（VICTORIATOURIST）拉杆箱PC+ABS商务旅行箱行李箱男 24英寸万向轮海关锁5518银色', '维多利亚旅行者（VICTORIATOURIST）拉杆箱PC+ABS商务旅行箱行李箱男 24英寸万向轮海关锁5518银色', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(26, '小米（MI）90分旅行箱拉杆箱 男女万向托运旅行皮箱24英寸轻巧便利出差旅游行李箱 星空灰-24英寸', '小米（MI）90分旅行箱拉杆箱 男女万向托运旅行皮箱24英寸轻巧便利出差旅游行李箱 星空灰-24英寸', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(27, '卡帝乐鳄鱼(CARTELO) 拉杆箱 万向轮旅行箱 20英寸登机箱行李箱密码箱子 幻影黑', '卡帝乐鳄鱼(CARTELO) 拉杆箱 万向轮旅行箱 20英寸登机箱行李箱密码箱子 幻影黑', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(28, '稻草人(MEXICAN)行李箱男女 24英寸大容量拉杆箱 德国拜耳PC材质万向轮静音海关密码锁旅行箱 商务黑', '稻草人(MEXICAN)行李箱男女 24英寸大容量拉杆箱 德国拜耳PC材质万向轮静音海关密码锁旅行箱 商务黑', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(29, '瑞动（SWISSMOBILITY）铝框拉杆箱24英寸密码锁行李箱 复古旅行箱静音万向飞机轮男女 5083奢华银', '瑞动（SWISSMOBILITY）铝框拉杆箱24英寸密码锁行李箱 复古旅行箱静音万向飞机轮男女 5083奢华银', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
    "(30, '【铝框防刮款】纯奢行李箱拉杆箱男铝框万向轮旅行箱学生密码箱女20/24/26/29英寸 经典黑 20英寸-登机箱', '【铝框防刮款】纯奢行李箱拉杆箱男铝框万向轮旅行箱学生密码箱女20/24/26/29英寸 经典黑 20英寸-登机箱', "
    + goods_images + ", " + details_images + ", '规格', 1, 1, 0, 1, 3);",
]


def insert_goods(cur):
    for x in goods_sql_values:
        sql = goods_sql_head + x
        try:
            cur.execute(sql)
        except Exception as err:
            print("SQL语句失败: ", sql, err)


# 商品规格
goods_spec_sql_head = "INSERT INTO `goodsspecification`(`price`, `spec_info`, `stock`, `goods_id`) VALUES "

goods_spec_sql_values = [
    "(186.00, '红色 20寸', 99999999, 1  );",
    "(286.00, '蓝色 24寸', 88888888, 1  );",
    "(386.00, '灰色 26寸', 66666666, 1  );",
    "(486.00, '白色 30寸', 55555555, 1  );",
    "(299.00, '红色 20寸', 99999999, 2  );",
    "(299.00, '蓝色 24寸', 88888888, 2  );",
    "(399.00, '灰色 26寸', 66666666, 2  );",
    "(499.00, '白色 30寸', 55555555, 2  );",
    "(299.00, '红色 20寸', 99999999, 3  );",
    "(299.00, '蓝色 24寸', 88888888, 3  );",
    "(399.00, '灰色 26寸', 66666666, 3  );",
    "(499.00, '白色 30寸', 55555555, 3  );",
    "(169.00, '红色 20寸', 99999999, 4  );",
    "(269.00, '蓝色 24寸', 88888888, 4  );",
    "(369.00, '灰色 26寸', 66666666, 4  );",
    "(469.00, '白色 30寸', 55555555, 4  );",
    "(186.00, '红色 20寸', 99999999, 5  );",
    "(286.00, '蓝色 24寸', 88888888, 5  );",
    "(386.00, '灰色 26寸', 66666666, 5  );",
    "(486.00, '白色 30寸', 55555555, 5  );",
    "(399.00, '红色 20寸', 99999999, 6  );",
    "(299.00, '蓝色 24寸', 88888888, 6  );",
    "(399.00, '灰色 26寸', 66666666, 6  );",
    "(499.00, '白色 30寸', 55555555, 6  );",
    "(399.00, '红色 20寸', 99999999, 7  );",
    "(299.00, '蓝色 24寸', 88888888, 7  );",
    "(399.00, '灰色 26寸', 66666666, 7  );",
    "(499.00, '白色 30寸', 55555555, 7  );",
    "(238.00, '红色 20寸', 99999999, 8  );",
    "(238.00, '蓝色 24寸', 88888888, 8  );",
    "(338.00, '灰色 26寸', 66666666, 8  );",
    "(438.00, '白色 30寸', 55555555, 8  );",
    "(152.00, '红色 20寸', 99999999, 9  );",
    "(252.00, '蓝色 24寸', 88888888, 9  );",
    "(352.00, '灰色 26寸', 66666666, 9  );",
    "(452.00, '白色 30寸', 55555555, 9  );",
    "(549.00, '红色 20寸', 99999999, 10 );",
    "(249.00, '蓝色 24寸', 88888888, 10 );",
    "(349.00, '灰色 26寸', 66666666, 10 );",
    "(449.00, '白色 30寸', 55555555, 10 );",
    "(299.00, '红色 20寸', 99999999, 11 );",
    "(299.00, '蓝色 24寸', 88888888, 11 );",
    "(399.00, '灰色 26寸', 66666666, 11 );",
    "(499.00, '白色 30寸', 55555555, 11 );",
    "(208.00, '红色 20寸', 99999999, 12 );",
    "(208.00, '蓝色 24寸', 88888888, 12 );",
    "(308.00, '灰色 26寸', 66666666, 12 );",
    "(408.00, '白色 30寸', 55555555, 12 );",
    "(369.00, '红色 20寸', 99999999, 13 );",
    "(269.00, '蓝色 24寸', 88888888, 13 );",
    "(369.00, '灰色 26寸', 66666666, 13 );",
    "(469.00, '白色 30寸', 55555555, 13 );",
    "(186.00, '红色 20寸', 99999999, 14 );",
    "(286.00, '蓝色 24寸', 88888888, 14 );",
    "(386.00, '灰色 26寸', 66666666, 14 );",
    "(486.00, '白色 30寸', 55555555, 14 );",
    "(449.00, '红色 20寸', 99999999, 15 );",
    "(249.00, '蓝色 24寸', 88888888, 15 );",
    "(349.00, '灰色 26寸', 66666666, 15 );",
    "(449.00, '白色 30寸', 55555555, 15 );",
    "(199.00, '红色 20寸', 99999999, 16 );",
    "(299.00, '蓝色 24寸', 88888888, 16 );",
    "(399.00, '灰色 26寸', 66666666, 16 );",
    "(499.00, '白色 30寸', 55555555, 16 );",
    "(449.00, '红色 20寸', 99999999, 17 );",
    "(249.00, '蓝色 24寸', 88888888, 17 );",
    "(349.00, '灰色 26寸', 66666666, 17 );",
    "(449.00, '白色 30寸', 55555555, 17 );",
    "(398.00, '红色 20寸', 99999999, 18 );",
    "(298.00, '蓝色 24寸', 88888888, 18 );",
    "(398.00, '灰色 26寸', 66666666, 18 );",
    "(498.00, '白色 30寸', 55555555, 18 );",
    "(159.00, '红色 20寸', 99999999, 19 );",
    "(259.00, '蓝色 24寸', 88888888, 19 );",
    "(359.00, '灰色 26寸', 66666666, 19 );",
    "(459.00, '白色 30寸', 55555555, 19 );",
    "(329.00, '红色 20寸', 99999999, 20 );",
    "(229.00, '蓝色 24寸', 88888888, 20 );",
    "(329.00, '灰色 26寸', 66666666, 20 );",
    "(429.00, '白色 30寸', 55555555, 20 );",
    "(258.00, '红色 20寸', 99999999, 21 );",
    "(258.00, '蓝色 24寸', 88888888, 21 );",
    "(358.00, '灰色 26寸', 66666666, 21 );",
    "(458.00, '白色 30寸', 55555555, 21 );",
    "(368.00, '红色 20寸', 99999999, 22 );",
    "(268.00, '蓝色 24寸', 88888888, 22 );",
    "(368.00, '灰色 26寸', 66666666, 22 );",
    "(468.00, '白色 30寸', 55555555, 22 );",
    "(469.00, '红色 20寸', 99999999, 23 );",
    "(269.00, '蓝色 24寸', 88888888, 23 );",
    "(369.00, '灰色 26寸', 66666666, 23 );",
    "(469.00, '白色 30寸', 55555555, 23 );",
    "(229.00, '红色 20寸', 99999999, 24 );",
    "(229.00, '蓝色 24寸', 88888888, 24 );",
    "(329.00, '灰色 26寸', 66666666, 24 );",
    "(429.00, '白色 30寸', 55555555, 24 );",
    "(248.00, '红色 20寸', 99999999, 25 );",
    "(248.00, '蓝色 24寸', 88888888, 25 );",
    "(348.00, '灰色 26寸', 66666666, 25 );",
    "(448.00, '白色 30寸', 55555555, 25 );",
    "(349.00, '红色 20寸', 99999999, 26 );",
    "(249.00, '蓝色 24寸', 88888888, 26 );",
    "(349.00, '灰色 26寸', 66666666, 26 );",
    "(449.00, '白色 30寸', 55555555, 26 );",
    "(169.00, '红色 20寸', 99999999, 27 );",
    "(269.00, '蓝色 24寸', 88888888, 27 );",
    "(369.00, '灰色 26寸', 66666666, 27 );",
    "(469.00, '白色 30寸', 55555555, 27 );",
    "(359.00, '红色 20寸', 99999999, 28 );",
    "(259.00, '蓝色 24寸', 88888888, 28 );",
    "(359.00, '灰色 26寸', 66666666, 28 );",
    "(459.00, '白色 30寸', 55555555, 28 );",
    "(499.00, '红色 20寸', 99999999, 29 );",
    "(299.00, '蓝色 24寸', 88888888, 29 );",
    "(399.00, '灰色 26寸', 66666666, 29 );",
    "(499.00, '白色 30寸', 55555555, 29 );",
    "(238.00, '红色 20寸', 99999999, 30 );",
    "(238.00, '蓝色 24寸', 88888888, 30 );",
    "(338.00, '灰色 26寸', 66666666, 30 );",
    "(438.00, '白色 30寸', 55555555, 30 );",
]


def insert_goods_spec(cur):
    for x in goods_spec_sql_values:
        sql = goods_spec_sql_head + x
        try:
            cur.execute(sql)
        except Exception as err:
            print("SQL语句失败: ", sql, "Error: ", err)


types_sqls = [
    "INSERT INTO `goodstype`(`id`, `title`, `is_delete`) VALUES (1, '拉杆箱', False);",
    "INSERT INTO `goodstype`(`id`, `title`, `is_delete`) VALUES (2, '手提包', False);",
    "INSERT INTO `goodstype`(`id`, `title`, `is_delete`) VALUES (3, '背包', False);",
]


def insert_types(cur):
    for sql in types_sqls:
        try:
            cur.execute(sql)
        except:
            print("SQL语句失败: ", sql)


# `123456` 加密串
# pbkdf2_sha1$36000$GQ9LhEukDogu$2F1fqmg4X0dJILSeqefkxPlUNcA=


def main():
    print("正在初始化测试数据库 ...")

    try:
        import pymysql
        conn = pymysql.connect(database='OnlyBuy', user='root', password='666666',
                               port=3306, host='localhost', use_unicode=True, charset='utf8')
        cur = conn.cursor()
    except:
        import sys
        print("Error: 打开数据库失败!")
        sys.exit()

    # 添加类型信息
    insert_types(cur)

    # 添加商品信息
    insert_goods(cur)

    # 添加商品规格信息
    insert_goods_spec(cur)

    conn.commit()

    cur.close()
    conn.close()
    print("完成测试数据库")


if __name__ == '__main__':
    main()
