"""
    day02 复习
    1. 变量：  关联对象的标示符
       变量名称 = 表达式
       变量没有类型，关联的对象才有。
        a = 10
        a = "10"
        动态：运行时

    2. 数据类型：
        整形　　浮点型　　　字符串　　　  布尔　　　    复数　　   None
        5       1.0       "1.0"   True False     1 + 2j    空

    3. 运算符:
        算数　　+ -  *  　　/ 　　　　 //   　　**    %
                  　　  浮点型　　　地板除          能否被整除
                                                　获取个位
    　　12345   -->  个位　　12345 % 10
       12345   -->  十位　　12345　//10  % 10

        增强
        a += 1   -=  *=  　　/= 　　　　 //=  　　**=    %=

        比较 >  <  ==  !=  >=   <=
            结果是：bool 类型

        逻辑    and　　　　or     not
        # 如果ａｎｄ前面的表达式结果为false，后面的表达式不再执行
        # 短路逻辑　
        # 建议：将耗时的判断尽量放在后面
        re = input("请输入a:") == "a" and input("请输入b:") == "b"

        身份　is   is not
        本质通过　id(对象)　函数判断对象地址

        print(1 + 27 + 4 / 2)   30
        print(1 + 3 ** 2 + 4 % 2)

"""










