"""
    实参传递方式
        位置传参
            序列传参
        关键字传参
            字典传参
"""


def fun1(a, b, c):
    print("a=", a)
    print("b=", b)
    print("c=", c)

# 位置传参：实参与形参的位置依次对应。
fun1(2,1,3)

# 序列传参：实参用*将序列拆解后与形参的位置依次对应
fun1(*[1,2,3])

# 关键字传参：实参根据形参的名字进行对应。
fun1(b = 2,a = 1,c = 3)

# 字典传参：实参用**将字典拆解与形参的名字进行对应。
fun1(**{"b":2,"a":1,"c":3})


# 默认(缺省)参数
def fun2(a=0, b=0, c=0):
    print("a=", a)
    print("b=", b)
    print("c=", c)
# 可以结合关键子传参，随意选择参数
fun2(b = 2)

def fun3(a, b=0, c=0):
    print("a=", a)
    print("b=", b)
    print("c=", c)

# a 是位置参数，必须传递
fun3(1)





