"""
    day06 复习
    1. 列表推导式
    list01 = [表达式 for 变量 in 可迭代对象 if 条件]

    2. 元组
    创建：()  tuple()
    获取元素：元组[索引]  元组[切片]

    if xxx == a  or  xxx == b
    xxx in (a,b)

    3. 字典
    创建： {"a":"A","b":"B"}
        d01 = dict([("a","A"),("b","B"),("c","C")])
        d01 =  dict(["aA","bB"])
    获取：字典名称[键]
         如果没有键则错误
             if 数据 in 字典:
                字典名称[键]

    添加/修改：字典名称[键] = 数据
    删除：del 字典名称[键]
"""
d01 = dict([("a", "A"), ("b", "B"), ("c", "C")])
print(d01)
print(d01['a'])


















